УправДом/src/Documents/ОплатаЭлектроснабжения/ОплатаЭлектроснабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЭлектроснабжения</name>
  <registerRecords>InformationRegister.СведенияПоЭлектроснабжению</registerRecords>
  <attributes>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПлатежа</name>
    <attributes>
      <name>ТекущиеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказанияНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтарыеПоказания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/СведенияПоЭлектроснабжению/СведенияПоЭлектроснабжению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоЭлектроснабжению</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущиеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяцаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/ОплатаЭлектроснабжения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверка, существует ли платеж за этот месяц
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаЭлектроснабжения.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумент,
		|	СведенияПоЭлектроснабжению.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцСведения
		|ИЗ
		|	РегистрСведений.СведенияПоЭлектроснабжению КАК СведенияПоЭлектроснабжению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаЭлектроснабжения КАК ОплатаЭлектроснабжения
		|		ПО СведенияПоЭлектроснабжению.ОплачиваемыйМесяц = ОплатаЭлектроснабжения.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаЭлектроснабжения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	 Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();;	
	    Отказ = Истина;
	КонецЕсли;	
	
	// регистр СведенияПоЭлектроснабжению
	Движения.СведенияПоЭлектроснабжению.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоЭлектроснабжению.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.ТекущиеПоказания = ТекСтрокаДанныеПлатежа.ТекущиеПоказания;
		Движение.ПоказанияНачисления = ТекСтрокаДанныеПлатежа.ПоказанияНачисления;
		Движение.СтарыеПоказания = ТекСтрокаДанныеПлатежа.СтарыеПоказания;
		Движение.Количество = ТекСтрокаДанныеПлатежа.Количество;
		Движение.Цена = ТекСтрокаДанныеПлатежа.Цена;
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
